---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsPath.ShowUpText
source: html/976971f1-f8c5-db80-c23c-ffadcd6d7bf5.htm
---
# Autodesk.Revit.DB.Architecture.StairsPath.ShowUpText Property

Represents whether show stairs up text or not.

## Syntax (C#)
```csharp
public bool ShowUpText { get; set; }
```